import 'package:flutter/material.dart';
import 'package:font_awesome_flutter/font_awesome_flutter.dart';

class Tutorial {
  final String title;
  final IconData icon;
  final String content;

  Tutorial({
    @required this.title,
    @required this.icon,
    @required this.content,
  });

  static List<Tutorial> generate() {
    return [
      Tutorial(
        title: 'ค้นหาข้อมูลยา',
        icon: FontAwesomeIcons.pills,
        content: '    ผู้ใช้งานสามารถสแกนบาร์โค็ต เพื่อค้นหาจากกล่องยา หรือผลิตภัณฑ์ต่าง ๆ และแปะตำหนิไว้ระบบจะแสดงข้อมูลจำเพาะของรายการยานั้น ๆ เช่น ข้อบ่งใช้ การใช้ยาต่าง ๆ เมื่อถึงเวลาใช้ยาด้วยตนเอง ผู้ใช้งานจะสามารถนำยามาสแกนเพื่อทราบข้อบ่งใช้ต่างๆ ได้ในโทรศัพท์รูปแบบการใช้งาน ผู้ใช้เลือกค้นหายาโดยการสแกนบาร์โค๊ค หรือใช้คำสำคัญโดยการพิมพ์ หรือ คำสั่งด้วยเสียงได้',
      ),
      Tutorial(
        title: 'เตือนการกินยา',
        icon: Icons.notifications,
        content: '    ฟังก์ชันตั้งการแจ้งเตือนเวลาการกินยาแต่ละมื้อ โดยสามารถเลือกจากรายการที่ค้นหาได้ โดยการตั้งเวลาล่วงหน้า เพื่อแจ้งเตือนการกินยามื้อต่าง ได้รูปแบบการใช้งาน ผู้ใช้สามารถเลือกเพิ่มรายการยา โดยการพิมพ์รายชื่อยา ด้วยคำสำคัญ หรือ คำสั่งเสียง ที่มีในฐานข้อมูลหรือยาที่บันทึกส่วนตัวลงไปใหม่ ให้แจ้งเตือนได้',
      ),
      Tutorial(
        title: 'ร้านขายยาใกล้เคียง',
        icon: FontAwesomeIcons.mapMarkerAlt,
        content: '    ฟังชันการค้นหาร้านยาใกล้เคียง ระบบจะค้นหาร้านยาเภสัช ที่ใกล้ที่สุดวิธีการใช้งาน เข้าฟังก์ชันนี้ แล้วระบบจะแสดงลำดับสถานที่ร้านยาที่ใกล้ที่สุด จากลิสรายการจากบนลงล่างเลือก Direction แล้ว เลือก Start ระบบจะนำทางให้ผู้ใช้งาน (คำนวณระยะทาง ทิศทางจาก ด้วยการเดินเท้า)',
      ),
      Tutorial(
        title: 'ขอความช่วยเหลือ',
        icon: Icons.call,
        content: '    ฟังก์ชันขอความช่วยเหลือ  ระบบจะนำลิสรายการ รายชื่อ ที่ผู้ใช้งานบันทึกไว้ เช่น เบอร์โทรศัพท์ร้านยา หรือบุคคลที่ติดต่อฉุกเฉินวิธีการใช้งาน เข้าฟังก์ชัน ขอความช่วยเหลือ ลิสรายการจะแสดงรายชื่อ กดเลือกเบอร์โทรที่ผู้ใช้งาน บันทึกไว้ ระบบจะเชื่อมต่อโทรศัพท์ไปยังปลายทางหากไม่มีรายการ ให้ผู้ใช้ บันทึกโดย เลือกที่ เพิ่ม แล้วบันทึกชื่อ ผู้ใช้งาน และหมายเลขโทร แล้วเลือก ปุ่มบันทึก ระบบจะบันทึกรายการไว้',
      ),
      Tutorial(
        title: 'บันทึกการใช้ยา',
        icon: FontAwesomeIcons.book,
        content: '    ผู้ใช้งานสามารถเพิ่มบันทึกการใช้ยาได้ โดยกดที่เครื่องหมายบวกบนหน้าจอจากนั้นจะปรากฏหน้าจอให้เลือกยา ให้ผู้ใช้เลือกยาที่ต้องการและใส่ปริมาณที่ใช้ยาจากนั้นกดเครื่องหมายถูกเพื่อบันทึก',
      ),
      Tutorial(
        title: 'ข้อมูลส่วนตัว',
        icon: Icons.person,
        content: '    ผู้ใช้สามารถเข้าดูหรือแก้ไขประวัติส่วนตัวได้ โดยจะต้องทำการสมัครสมาชิกและเข้าสู่ระบบก่อน',
      ),
    ];
  }
}
